; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-4 - location
	p1-0 - location
	p1-3 - location
	p2-4 - location
	p3-4 - location
	p4-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s1)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at package1 s4)
	(at package2 s3)
	(at package3 s0)
	(at package4 s2)
	(at package5 s4)
	(at package6 s2)
	(at package7 s4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 68)
	(= (time-to-walk p0-2 s0) 68)
	(= (time-to-walk s2 p0-2) 96)
	(= (time-to-walk p0-2 s2) 96)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 49)
	(= (time-to-walk p0-4 s0) 49)
	(= (time-to-walk s4 p0-4) 28)
	(= (time-to-walk p0-4 s4) 28)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 11)
	(= (time-to-walk p1-0 s1) 11)
	(= (time-to-walk s0 p1-0) 59)
	(= (time-to-walk p1-0 s0) 59)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 91)
	(= (time-to-walk p1-3 s1) 91)
	(= (time-to-walk s3 p1-3) 71)
	(= (time-to-walk p1-3 s3) 71)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 89)
	(= (time-to-walk p2-4 s2) 89)
	(= (time-to-walk s4 p2-4) 72)
	(= (time-to-walk p2-4 s4) 72)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 66)
	(= (time-to-walk p3-4 s3) 66)
	(= (time-to-walk s4 p3-4) 45)
	(= (time-to-walk p3-4 s4) 45)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(= (time-to-walk s4 p4-1) 76)
	(= (time-to-walk p4-1 s4) 76)
	(= (time-to-walk s1 p4-1) 45)
	(= (time-to-walk p4-1 s1) 45)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 26)
	(= (time-to-drive s1 s0) 26)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 98)
	(= (time-to-drive s4 s0) 98)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 46)
	(= (time-to-drive s3 s1) 46)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 53)
	(= (time-to-drive s0 s2) 53)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 11)
	(= (time-to-drive s1 s2) 11)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 2)
	(= (time-to-drive s4 s2) 2)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 46)
	(= (time-to-drive s0 s3) 46)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 16)
	(= (time-to-drive s4 s3) 16)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 95)
	(= (time-to-drive s1 s4) 95)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s4)
	(at driver4 s0)
	(at truck1 s0)
	(at truck2 s1)
	(at truck3 s4)
	(at truck4 s0)
	(at truck5 s1)
	(at package2 s4)
	(at package3 s1)
	(at package5 s1)
	(at package6 s4)
	(at package7 s0)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver2 truck5 s2)
   deleted: (at driver2 s2) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 2 of 13
2. (load-truck package2 truck3 s3)
   deleted: (at package2 s3)
   added: (in package2 truck3)
   goals met: 2 of 13
3. (walk driver4 s1 p1-0)
   deleted: (at driver4 s1)
   added: (at driver4 p1-0)
   changed: (walked) from 0 to 11
   goals met: 2 of 13
4. (walk driver4 p1-0 s0)
   deleted: (at driver4 p1-0)
   added: (at driver4 s0)
   changed: (walked) from 11 to 70
   goals met: 3 of 13
5. (load-truck package6 truck5 s2)
   deleted: (at package6 s2)
   added: (in package6 truck5)
   goals met: 3 of 13
6. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 13
7. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 0 to 53
   goals met: 3 of 13
8. (load-truck package3 truck5 s0)
   deleted: (at package3 s0)
   added: (in package3 truck5)
   goals met: 3 of 13
9. (drive-truck truck5 s0 s4 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (driven) from 53 to 151
   goals met: 3 of 13
10. (unload-truck package6 truck5 s4)
   deleted: (in package6 truck5)
   added: (at package6 s4)
   goals met: 4 of 13
11. (load-truck package5 truck5 s4)
   deleted: (at package5 s4)
   added: (in package5 truck5)
   goals met: 4 of 13
12. (load-truck package7 truck5 s4)
   deleted: (at package7 s4)
   added: (in package7 truck5)
   goals met: 4 of 13
13. (drive-truck truck3 s3 s4 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   changed: (driven) from 151 to 167
   goals met: 5 of 13
14. (unload-truck package2 truck3 s4)
   deleted: (in package2 truck3)
   added: (at package2 s4)
   goals met: 6 of 13
15. (disembark-truck driver3 truck3 s4)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 7 of 13
16. (drive-truck truck5 s4 s1 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 167 to 262
   goals met: 8 of 13
17. (unload-truck package5 truck5 s1)
   deleted: (in package5 truck5)
   added: (at package5 s1)
   goals met: 9 of 13
18. (drive-truck truck5 s1 s0 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (driven) from 262 to 288
   goals met: 8 of 13
19. (unload-truck package7 truck5 s0)
   deleted: (in package7 truck5)
   added: (at package7 s0)
   goals met: 9 of 13
20. (drive-truck truck5 s0 s3 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 288 to 334
   goals met: 9 of 13
21. (disembark-truck driver2 truck5 s3)
   deleted: (driving driver2 truck5)
   added: (at driver2 s3) (empty truck5)
   goals met: 9 of 13
22. (unload-truck package3 truck5 s3)
   deleted: (in package3 truck5)
   added: (at package3 s3)
   goals met: 9 of 13
23. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 9 of 13
24. (board-truck driver2 truck1 s3)
   deleted: (at driver2 s3) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 9 of 13
25. (drive-truck truck1 s3 s4 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 334 to 350
   goals met: 9 of 13
26. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 10 of 13
27. (walk driver2 s4 p3-4)
   deleted: (at driver2 s4)
   added: (at driver2 p3-4)
   changed: (walked) from 70 to 115
   goals met: 9 of 13
28. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 8 of 13
29. (walk driver2 p3-4 s3)
   deleted: (at driver2 p3-4)
   added: (at driver2 s3)
   changed: (walked) from 115 to 181
   goals met: 8 of 13
30. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 8 of 13
31. (drive-truck truck5 s3 s4 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   changed: (driven) from 350 to 366
   goals met: 8 of 13
32. (disembark-truck driver3 truck1 s4)
   deleted: (driving driver3 truck1)
   added: (at driver3 s4) (empty truck1)
   goals met: 9 of 13
33. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 8 of 13
34. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 8 of 13
35. (disembark-truck driver2 truck5 s4)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 9 of 13
36. (drive-truck truck3 s4 s1 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 366 to 461
   goals met: 8 of 13
37. (board-truck driver2 truck5 s4)
   deleted: (at driver2 s4) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 7 of 13
38. (load-truck package3 truck5 s4)
   deleted: (at package3 s4)
   added: (in package3 truck5)
   goals met: 7 of 13
39. (drive-truck truck5 s4 s1 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 461 to 556
   goals met: 8 of 13
40. (walk driver4 s0 p0-4)
   deleted: (at driver4 s0)
   added: (at driver4 p0-4)
   changed: (walked) from 181 to 230
   goals met: 7 of 13
41. (drive-truck truck3 s1 s4 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (driven) from 556 to 651
   goals met: 8 of 13
42. (disembark-truck driver3 truck3 s4)
   deleted: (driving driver3 truck3)
   added: (at driver3 s4) (empty truck3)
   goals met: 9 of 13
43. (drive-truck truck5 s1 s4 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (driven) from 651 to 746
   goals met: 8 of 13
44. (disembark-truck driver2 truck5 s4)
   deleted: (driving driver2 truck5)
   added: (at driver2 s4) (empty truck5)
   goals met: 9 of 13
45. (unload-truck package3 truck5 s4)
   deleted: (in package3 truck5)
   added: (at package3 s4)
   goals met: 9 of 13
46. (board-truck driver2 truck3 s4)
   deleted: (at driver2 s4) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 13
47. (drive-truck truck3 s4 s1 driver2)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   changed: (driven) from 746 to 841
   goals met: 7 of 13
48. (load-truck package3 truck5 s4)
   deleted: (at package3 s4)
   added: (in package3 truck5)
   goals met: 7 of 13
49. (board-truck driver3 truck5 s4)
   deleted: (at driver3 s4) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 6 of 13
50. (drive-truck truck5 s4 s1 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 841 to 936
   goals met: 7 of 13
51. (walk driver4 p0-4 s4)
   deleted: (at driver4 p0-4)
   added: (at driver4 s4)
   changed: (walked) from 230 to 258
   goals met: 7 of 13
52. (drive-truck truck3 s1 s4 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   changed: (driven) from 936 to 1031
   goals met: 8 of 13
53. (drive-truck truck5 s1 s4 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (driven) from 1031 to 1126
   goals met: 7 of 13
54. (disembark-truck driver3 truck5 s4)
   deleted: (driving driver3 truck5)
   added: (at driver3 s4) (empty truck5)
   goals met: 8 of 13
55. (board-truck driver3 truck1 s4)
   deleted: (at driver3 s4) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 13
56. (board-truck driver4 truck5 s4)
   deleted: (at driver4 s4) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 7 of 13
57. (disembark-truck driver2 truck3 s4)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 8 of 13
58. (drive-truck truck5 s4 s0 driver4)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (driven) from 1126 to 1224
   goals met: 8 of 13
59. (disembark-truck driver4 truck5 s0)
   deleted: (driving driver4 truck5)
   added: (at driver4 s0) (empty truck5)
   goals met: 9 of 13
60. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 8 of 13
61. (unload-truck package3 truck5 s0)
   deleted: (in package3 truck5)
   added: (at package3 s0)
   goals met: 8 of 13
62. (load-truck package3 truck4 s0)
   deleted: (at package3 s0)
   added: (in package3 truck4)
   goals met: 8 of 13
63. (drive-truck truck4 s0 s1 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 1224 to 1250
   goals met: 7 of 13
64. (unload-truck package3 truck4 s1)
   deleted: (in package3 truck4)
   added: (at package3 s1)
   goals met: 8 of 13
65. (drive-truck truck1 s4 s0 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 1250 to 1348
   goals met: 9 of 13
66. (disembark-truck driver3 truck1 s0)
   deleted: (driving driver3 truck1)
   added: (at driver3 s0) (empty truck1)
   goals met: 9 of 13
67. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   changed: (walked) from 258 to 307
   goals met: 9 of 13
68. (walk driver3 p0-4 s4)
   deleted: (at driver3 p0-4)
   added: (at driver3 s4)
   changed: (walked) from 307 to 335
   goals met: 10 of 13
69. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   changed: (walked) from 335 to 346
   goals met: 10 of 13
70. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   changed: (walked) from 346 to 405
   goals met: 10 of 13
71. (drive-truck truck4 s1 s0 driver4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 1348 to 1374
   goals met: 11 of 13
72. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 12 of 13
73. (board-truck driver1 truck5 s0)
   deleted: (at driver1 s0) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 12 of 13
74. (drive-truck truck5 s0 s1 driver1)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (driven) from 1374 to 1400
   goals met: 13 of 13
